export default {
  pages: {
    home: 'Главная',
    projects: 'Проекты',
    about: 'Обо мне',
    controlPanel: 'Панель управления',
  },
  buttons: {
    contactMe: 'Написать мне 👋🏻',
    menu: 'Меню',
    showAll: 'Посмотреть все',
  },
  mobileMenu: {
    navigation: 'Навигация',
    changeLanguage: 'Сменить язык',
  },
  headings: {
    myProjects: 'Мои проекты',
  },
  home: {
    description:
      'Я фронтенд-разработчик из Москвы, пишу сайты на Nuxt, делаю дизайн в Sketch.',
  },

  projects: {
    card: {
      view: 'Перейти',
    },
  },
}
