export default {
  pages: {
    home: 'Главная',
    projects: 'Проекты',
    about: 'Обо мне',
    message: 'Написать мне',
    controlPanel: 'Панель управления',
    auth: 'Авторизация',
    admin: {
      dashboard: 'Краткая сводка',
      projects: 'Проекты',
      messages: 'Сообщения',
    },
  },
  buttons: {
    contactMe: 'Написать мне 👋🏻',
    menu: 'Меню',
    showAll: 'Посмотреть все',
    login: 'Войти',
    logout: 'Выйти',
    return: 'Вернуться на главную',
  },
  mobileMenu: {
    navigation: 'Навигация',
    changeLanguage: 'Сменить язык',
  },
  headings: {
    myProjects: 'Мои проекты',
    aboutMe: 'Обо мне',
  },
  home: {
    description:
      'Я фронтенд-разработчик из Москвы, пишу сайты на Nuxt, делаю дизайн в Sketch.',
  },
  projects: {
    card: {
      view: 'Перейти',
    },
  },
  about: {
    name: 'Василий Кузин',
    firstWord: 'Мне',
    and: 'и',
    paragraph_1_1:
      'лет, я из Москвы. Я успел поработать с множеством фреймфорков и различных технологий. Сейчас в работе использую',
    paragraph_1_2: 'Дизайн сайтов делаю в',
    paragraph_2:
      'Ещё я хорошо знаю чистый CSS, а также умею работать с препроцессорами. Кроме того я обладаю базовыми знаниями',
    paragraph_3:
      'Этот сайт может послужить отличным примером того, как я пишу код, поэтому я открыл доступ к его исходному коду на GitHub.',
  },
  auth: {
    title: 'Авторизация',
    email: 'Электронная почта',
    password: 'Пароль',
    passwordPlaceholder: 'Минимум 6 символов',
  },
  message: {
    name: 'Ваше имя',
    email: 'Электронная почта',
    message: 'Сообщение',
    messagePlaceholder: 'Введите ваше сообщение',
    send: 'Отправить',
    popup: {
      title: 'Сообщение отправлено',
      titleError: 'Ошибка',
      message:
        'Ваше сообщение было отправлено. Я постараюсь ответить на него в ближайшее время.',
    },
  },
}
